import photographyImage from "../assets/photography.png";
import coverageImage from "../assets/coverage.png";
import videoImage from "../assets/video.png";
import digitalMarketingImage from "../assets/digital-marketing.png";
import fashionImage from "../assets/fashion.jpg";

export const services = [
    {
        id: "photography",
        title: "تصوير فوتوغرافي",
        description:
            "نختص في إنتاج محتوى مرئي جذاب يجذب الانتباه ويعزز الرسائل التسويقية. نستخدم تقنيات حديثة في التصوير والتحرير، مما يمكننا من تقديم أفلام قصيرة ومقاطع فيديو تروي قصصاً بصرية تدعم أهداف العلامة التجارية وتصل إلى الجمهور بفعالية.",
        image: photographyImage,
    },
    {
        id: "coverage",
        title: "التغطيات",
        description:
            "نقدم خدمة التغطيات الشاملة للفعاليات، حيث نحرص على توثيق اللحظات المهمة بطريقة احترافية. يضمن فريقنا التقني الالتقاط الفوري لأفضل اللحظات، مما يساهم في إبراز الفعالية وتعزيز حضور العلامة التجارية في أذهان الجمهور.",
        image: coverageImage,
    },
    {
        id: "video",
        title: "التصوير المرئى",
        description:
            "نعمل في مجال التسويق الرقمي على تطوير استراتيجيات مبتكرة تعزز من وجود العلامات التجارية على الإنترنت. نركز على استخدام التحليلات لفهم سلوك العملاء، مما يمكننا من تصميم حملات تسويقية فعالة تصل إلى الجمهور المستهدف وتحقق نتائج ملموسة.",
        image: videoImage,
    },
    {
        id: "digital-marketing",
        title: "التسويق الرقمي",
        description:
            "نعمل في مجال التسويق الرقمي على تطوير استراتيجيات مبتكرة تعزز من وجود العلامات التجارية على الإنترنت. نركز على استخدام التحليلات لفهم سلوك العملاء، مما يمكننا من تصميم حملات تسويقية فعالة تصل إلى الجمهور المستهدف وتحقق نتائج ملموسة.",
        image: digitalMarketingImage,
    },
    {
        id: "fashion",
        title: "تصوير الأزياء",
        description:
            "نقدم خدمات تصوير الأزياء بأسلوب فني يجمع بين الإبداع والاحترافية. نحن نعمل على إبراز جمال القطع الفنية والملابس بطريقة تجعل كل صورة تعكس رؤية المصمم وتروي قصة فريدة تلامس مشاعر المشاهد.",
        image: fashionImage,
    },
];
